Барбершоп/src/Documents/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Зарплата</name>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Салон</name>
    <type>
      <types>CatalogRef.Салоны</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Барбершоп/src/AccumulationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Зарплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Салон</name>
    <type>
      <types>CatalogRef.Салоны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Барбершоп/src/Documents/Зарплата/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.Сотрудники.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗарплатаОстатки.Сотрудник КАК Сотрудник,
		|	ЗарплатаОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.Зарплата.Остатки(
		|			&Дата,
		|			Салон = &Салон
		|				И Месяц = &Месяц) КАК ЗарплатаОстатки";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Салон", объект.Салон);
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Объект.Месяц));
	
	Результат = Запрос.Выполнить();
	
	Выборка= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
 		СтрокаТч = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
КонецПроцедуры
